{
  "overview": {
    "total_conversations": 406,
    "total_files_processed": 2,
    "processed_date": "2025-08-07"
  },
  "assignee_breakdown": {
    "Sawwaf": 130,
    "Multiple": 276
  },
  "label_analysis": {
    "no response from the client": 134,
    "no matching maids found": 70,
    "System transfer (no reason ) ": 14,
    "the bot hallicunate (unknown)": 8,
    "sys: Attention: V3 Prospect!": 5,
    "two system transfer: the client needs a specific maid to hire": 3,
    "System transfer  (no reason and sys: ARP API failed, no bot) ": 3,
    "agent stepped in without a reason (with bot skill)": 3,
    "System transfer (no reason + no bot) ": 2,
    "System transfer (client asked if the nanny will arrive tmrw) ": 2,
    "System transfer (no matching maids found) ": 2,
    "the client asked about a specific maid to hire": 2,
    "no bot, repeated messages from system": 2,
    "bot transfered the client to sales team": 1,
    "after calling the client": 3,
    "provided a list knowing that the bot provided one": 1,
    "agent stepped in at the end with no need (You are most welcome, please feel free to reach out for any further assistance)": 2,
    "np provided videos + no response from the bot \nno response from the client\nagent confirming the hiring at the end": 1,
    "client asked to talk to a human, then the agent call him": 2,
    "unknown": 1,
    "Agent intervened after system failed to find any maids matching consumer's requirements.": 4,
    "Agent intervened for a follow up with consumer after 55 minutes without reply from consumer.": 1,
    "Agent intervened for a follow up with consumer after 10.5 hours (overnight) without reply from consumer.": 1,
    "Agent intervened for a follow up with consumer after 20 minutes without reply from consumer.": 1,
    "Agent interevened after private message from system to support the prospect after consumer inquired about part-time maids.": 1,
    "Agent intervened for a follow up with consumer after 60 minutes without reply from consumer.": 1,
    "Agent intervened for a follow up with consumer after 15 minutes without reply from consumer.": 1,
    "Agent intervened after bot failed to reply for 11 minutes.": 1,
    "Agent intervened after consumer complained they weren't offered the same package price as their brother.": 1,
    "Agent intervened for a follow up with consumer after 35 minutes without reply from consumer.": 1,
    "Agent intervened after consumer expressed their disinterest in hiring a maid after inquiring about hiring one. ": 1,
    "Agent interevened after private message from system to support the prospect after consumer complained about prices.": 1,
    "providing a shortlist link while the bot sent one": 8,
    "fully handled": 4,
    "Two system transfer with no bot": 3,
    "system transfer: no matching maids found": 3,
    "the client asked for a call (called)": 3,
    "System transfer (no reason) ": 2,
    "wrong info from the bot": 2,
    "two system transfer in the beginning: no clear reason": 2,
    "system transfer: no reason": 2,
    "no matching maids found\nno response from the client": 2,
    "fully handled ": 2,
    "when the consumer's skill changed to an agent skill, the agent respond ": 2,
    "the bot is delayed in responding + the agent provided a link\nno matching maids found": 1,
    "the above one should be here": 1,
    "the agent mentioned that the maid is available now": 1,
    "no response from the bot for providing the offer letter": 1,
    "the bot didn't provide the video link": 1,
    "bot: Thanks for contacting us! We'll get back to you with an answer first thing in the morning.\nno matching maids found": 1,
    "the bot transferred the client to a live agent because he doesn't have the ability to generate a hiring link\nno response from the client": 1,
    "no response from the bot\nproviding a shortlist link while the bot sent one\nwrong info": 1,
    "no bot response (3 mins), the agent provided a link": 1,
    "the client want to talk to a real person\nno response fromt the client": 1,
    "the conv started with agent skill\nno matching maids found": 1,
    "providing a shortlist link while the bot sent one\nclient asked for a call": 1,
    "the bot transferred the client to a live agent because he doesn't have the ability to see the maids info after served by the client\nno matching maids found": 1,
    "no response from the client\nbot provided wrong info (availabe for hiring)": 1,
    "the agent stepped in without a reason, because the client finished his conv": 1,
    "two system transfer at the beginning but without a reason (no bot) + consumern started with agent skill": 1,
    "agent stepped in at the end mentioning he tried to call the client but no answer": 1,
    "asked for a call (further to your call)": 1,
    "agent asked the client to fill some info after 2 min from the bot not sending them": 1,
    "the bot don't have the infor if the maid is christian ": 1,
    "no response from the bot after 5 min + he didn't ask about the family name of the maid": 1,
    "the bot can't provide a website link (the client want to share it with someone)": 1,
    "no response from the bot (17mins)": 1,
    "system transfer: the consumer need a live agent": 1,
    "consumer started with agent skill + consumer issue: can't afford the month payment": 1,
    "no response from the bot after 3 mins": 1,
    "conv started with agent skill (no bot)": 1,
    "the bot didn't answer one of the consumer questions": 1,
    "bot provided invalid link": 1,
    "no response from the bot (after hours)": 1,
    "no response from the client\nno response from the client": 1,
    "bot provided undesired info": 1,
    "stepped in at the end without a reason (you are most wel)": 1,
    "two system transfer without a reason": 1,
    "bot didn't answer client question\nclient is unsatisfied with the prices\n": 1,
    "no bot response\nno matching maids found": 1,
    "the client contact the wrong department, so the bot transfer him (it is for cancellation)": 1,
    "system transfer: agent try to convince the client about the maids transportation (want to call the client)": 1,
    "the bot provided a different link + bot gave wrong info": 1,
    "the client don't want to deal with a chat bot (the bot sent the same link)": 1,
    "agent stepped in at the end, I don't think there is a reason": 1,
    "no response from the bot\nno response from the client": 1,
    "client asked for a call (the agent continue the chat, not further your call)": 1,
    "the bot sent the same link": 1,
    "System transfer  (no reason and no bot) + client unsatisfied with the prices": 1,
    "System: Attention: V3 Prospect!": 1,
    "system transfer (no reason) ": 1,
    "unsatisfied with the price": 1,
    "the link is broken": 1,
    "Agent stepped in (reported missed info)": 1,
    "no reponse from the client + the bot sent a broken link": 1,
    "System transfer (client asked to talk to a real person) ": 1,
    "System transfer (client asked if the nanny has experience or not) ": 1,
    "System transfer (bot started hallucinating) ": 1,
    "System transfer(no reason) ": 1,
    "no response from the bot": 1,
    "agent stepped in bc client was not satistified with prices (with bot skill)": 1,
    "System transfer (client wants to talk to a specialist) ": 1,
    "agent stepped in (wishes to speak with a live agent on chat and not gpt ), no clear reason": 1,
    "System transfer (no response from the client) ": 1,
    "System transfer (bot start hallucinating) ": 1,
    "when the system's skill changed to \"GPT CC Shad\", the agent respond ": 1,
    "System: transfer (no reason ) ": 1,
    "the bot transfered the client to the sales team to renew the service": 1,
    "no response from the bot (7 mins)": 1,
    " no response from the bot \nagent confirming the hiring at the end": 1,
    "bot provided the wrong info\nno response from the client": 1,
    "the bot forwarded the conversation to an agent (for the maid's eligibility)": 1,
    "no matching maids found + no repsonse from the bot": 1,
    " no bot response (6mins)": 1,
    "stepped in without a reason at the end (Sure, we're looking forward to hearing back from you.)": 1,
    "the client asked to talk to someone": 1,
    "client ask for a call\nthe link didn't open\n": 1,
    "no response from client": 1,
    "system transfer: no reason,  the client asked for hiring a second maid (in the beginning)": 1,
    "bot transfered the client to sales team\nbot hallucination": 1,
    "agent started with the conversation (no bot), bot hallucination": 1,
    "client ask for a call (called)": 1,
    "system transfer: the bot provided wrong info": 1,
    "Agent started with the conversation\nstepped in without a reason (when you want to hire a maid) but no need for it": 1,
    "two system transfer at the beginnig with no reason\nproviding a shortlist link while the bot sent one\nno response from the client": 1,
    "client ask for someone speaks arabic": 1,
    "System transfer (the client is frustrated bs msh znb lbot ) ": 1,
    "system trasnfer: client asked for a live out maid for 1 week": 1,
    "system transfer (bot: Thanks for contacting us! We'll get back to you with an answer first thing in the morning.)": 1,
    "the bot transfered the client to someone speaks arabic": 1,
    "providing a shortlist link while the bot sent one\nno response from the client": 1
  },
  "effectiveness_stats": {
    "reengagement": {
      "yes": 187,
      "no": 75
    },
    "sale": {
      "yes": 18,
      "no": 244
    },
    "bot_can_do": {
      "yes": 205,
      "no": 45
    }
  },
  "performance_metrics": {
    "reengagement_rate": 46.05911330049261,
    "sales_rate": 4.433497536945813,
    "bot_success_rate": 50.49261083743842
  }
}